[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:15:42
   }
 
   updateQuality() {
-    const decreasesInQuality = (item) => item.quality > 0 && item.name != "Sulfuras, Hand of Ragnaros";
+    const decreasesInQuality = (item) => true;
     const increasesInQuality = (item) => item.quality < 50;
     const isLegendaryItem = (item) => item.name == "Sulfuras, Hand of Ragnaros";
killedBy: Gilded Rose:update quality when items are not named Aged brie or Backstage passes to a TAFKAL80ETC concert should not update if quality is 0
statusReason: expected -1 to equal 0

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:15:42
   }
 
   updateQuality() {
-    const decreasesInQuality = (item) => item.quality > 0 && item.name != "Sulfuras, Hand of Ragnaros";
+    const decreasesInQuality = (item) => true && item.name != "Sulfuras, Hand of Ragnaros";
     const increasesInQuality = (item) => item.quality < 50;
     const isLegendaryItem = (item) => item.name == "Sulfuras, Hand of Ragnaros";
killedBy: Gilded Rose:update quality when items are not named Aged brie or Backstage passes to a TAFKAL80ETC concert should not update if quality is 0
statusReason: expected -1 to equal 0

[Killed] EqualityOperator
mooc/tdd-ex4/src/gilded_rose.js:16:42
 
   updateQuality() {
     const decreasesInQuality = (item) => item.quality > 0 && item.name != "Sulfuras, Hand of Ragnaros";
-    const increasesInQuality = (item) => item.quality < 50;
+    const increasesInQuality = (item) => item.quality >= 50;
     const isLegendaryItem = (item) => item.name == "Sulfuras, Hand of Ragnaros";
 
killedBy: Gilded Rose:update quality when the item is Aged Brie should increment quality by one when quality is less than 50
statusReason: expected 10 to equal 11

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:16:42
 
   updateQuality() {
     const decreasesInQuality = (item) => item.quality > 0 && item.name != "Sulfuras, Hand of Ragnaros";
-    const increasesInQuality = (item) => item.quality < 50;
+    const increasesInQuality = (item) => true;
     const isLegendaryItem = (item) => item.name == "Sulfuras, Hand of Ragnaros";
 
killedBy: Gilded Rose:update quality when the item is Aged Brie should not increment quality when quality is 50
statusReason: expected 51 to equal 50

[Killed] EqualityOperator
mooc/tdd-ex4/src/gilded_rose.js:17:39
   updateQuality() {
     const decreasesInQuality = (item) => item.quality > 0 && item.name != "Sulfuras, Hand of Ragnaros";
     const increasesInQuality = (item) => item.quality < 50;
-    const isLegendaryItem = (item) => item.name == "Sulfuras, Hand of Ragnaros";
+    const isLegendaryItem = (item) => item.name != "Sulfuras, Hand of Ragnaros";
 
     return this.items.map((item) => {
killedBy: Gilded Rose:update quality should not decrement the sell in of items named 'Sulfuras, Hand of Ragnaros'
statusReason: expected 0 to equal 1

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:17:39
   updateQuality() {
     const decreasesInQuality = (item) => item.quality > 0 && item.name != "Sulfuras, Hand of Ragnaros";
     const increasesInQuality = (item) => item.quality < 50;
-    const isLegendaryItem = (item) => item.name == "Sulfuras, Hand of Ragnaros";
+    const isLegendaryItem = (item) => false;
 
     return this.items.map((item) => {
killedBy: Gilded Rose:update quality should not decrement the sell in of items named 'Sulfuras, Hand of Ragnaros'
statusReason: expected 0 to equal 1

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:20:34
     const isLegendaryItem = (item) => item.name == "Sulfuras, Hand of Ragnaros";
 
     return this.items.map((item) => {
-      const itemIsPastSaleDate = item.sellIn < 0;
+      const itemIsPastSaleDate = true;
 
       switch (item.name) {
killedBy: Gilded Rose:update quality when items are not named Aged brie or Backstage passes to a TAFKAL80ETC concert should degrade quality of item(s) by one
statusReason: expected 8 to equal 9

[Killed] EqualityOperator
mooc/tdd-ex4/src/gilded_rose.js:20:34
     const isLegendaryItem = (item) => item.name == "Sulfuras, Hand of Ragnaros";
 
     return this.items.map((item) => {
-      const itemIsPastSaleDate = item.sellIn < 0;
+      const itemIsPastSaleDate = item.sellIn <= 0;
 
       switch (item.name) {
killedBy: Gilded Rose:update quality when the item is Aged Brie should increment quality by one when quality is less than 50
statusReason: expected 12 to equal 11

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:23:9
       const itemIsPastSaleDate = item.sellIn < 0;
 
       switch (item.name) {
-        case "Aged Brie":
-          if (!increasesInQuality(item)) break;
-
-          if (itemIsPastSaleDate) {
-            item.quality += 2;
-          } else {
-            item.quality += 1;
-          }
-          break;
+        case "Aged Brie":
         case "Backstage passes to a TAFKAL80ETC concert":
           if (itemIsPastSaleDate) {
killedBy: Gilded Rose:update quality when the item is Aged Brie should increment quality by one when quality is less than 50
statusReason: expected 13 to equal 11

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:24:15
 
       switch (item.name) {
         case "Aged Brie":
-          if (!increasesInQuality(item)) break;
+          if (false) break;
 
           if (itemIsPastSaleDate) {
killedBy: Gilded Rose:update quality when the item is Aged Brie should not increment quality when quality is 50
statusReason: expected 51 to equal 50

[Killed] BooleanLiteral
mooc/tdd-ex4/src/gilded_rose.js:24:15
 
       switch (item.name) {
         case "Aged Brie":
-          if (!increasesInQuality(item)) break;
+          if (increasesInQuality(item)) break;
 
           if (itemIsPastSaleDate) {
killedBy: Gilded Rose:update quality when the item is Aged Brie should increment quality by one when quality is less than 50
statusReason: expected 10 to equal 11

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:26:15
         case "Aged Brie":
           if (!increasesInQuality(item)) break;
 
-          if (itemIsPastSaleDate) {
+          if (false) {
             item.quality += 2;
           } else {
killedBy: Gilded Rose:update quality when the item is Aged Brie should increment the quality by 2 when quality is less than 50
statusReason: expected 11 to equal 12

[Killed] BlockStatement
mooc/tdd-ex4/src/gilded_rose.js:26:35
         case "Aged Brie":
           if (!increasesInQuality(item)) break;
 
-          if (itemIsPastSaleDate) {
-            item.quality += 2;
-          } else {
+          if (itemIsPastSaleDate) {} else {
             item.quality += 1;
           }
killedBy: Gilded Rose:update quality when the item is Aged Brie should increment the quality by 2 when quality is less than 50
statusReason: expected 10 to equal 12

[Killed] BlockStatement
mooc/tdd-ex4/src/gilded_rose.js:28:18
 
           if (itemIsPastSaleDate) {
             item.quality += 2;
-          } else {
-            item.quality += 1;
-          }
+          } else {}
           break;
         case "Backstage passes to a TAFKAL80ETC concert":
killedBy: Gilded Rose:update quality when the item is Aged Brie should increment quality by one when quality is less than 50
statusReason: expected 10 to equal 11

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:32:9
             item.quality += 1;
           }
           break;
-        case "Backstage passes to a TAFKAL80ETC concert":
-          if (itemIsPastSaleDate) {
-            item.quality = 0;
-            break;
-          }
-
-          if (!increasesInQuality(item)) break;
-
-          if (item.sellIn <= 5) {
-            item.quality += 3;
-            break;
-          }
-          if (item.sellIn <= 10) {
-            item.quality += 2;
-            break;
-          }
-          item.quality += 1;
-          break;
+        case "Backstage passes to a TAFKAL80ETC concert":
         default:
           if (decreasesInQuality(item)) {
killedBy: Gilded Rose:update quality when the item is named Backstage passes to a TAFKAL80ETC concert should increment quality by three when quality is less than 50 and sell in is 5 or less
statusReason: expected 9 to equal 13

[Killed] StringLiteral
mooc/tdd-ex4/src/gilded_rose.js:32:14
             item.quality += 1;
           }
           break;
-        case "Backstage passes to a TAFKAL80ETC concert":
+        case "":
           if (itemIsPastSaleDate) {
             item.quality = 0;
killedBy: Gilded Rose:update quality when the item is named Backstage passes to a TAFKAL80ETC concert should increment quality by three when quality is less than 50 and sell in is 5 or less
statusReason: expected 9 to equal 13

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:33:15
           }
           break;
         case "Backstage passes to a TAFKAL80ETC concert":
-          if (itemIsPastSaleDate) {
+          if (true) {
             item.quality = 0;
             break;
killedBy: Gilded Rose:update quality when the item is named Backstage passes to a TAFKAL80ETC concert should increment quality by three when quality is less than 50 and sell in is 5 or less
statusReason: expected 0 to equal 13

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:33:15
           }
           break;
         case "Backstage passes to a TAFKAL80ETC concert":
-          if (itemIsPastSaleDate) {
+          if (false) {
             item.quality = 0;
             break;
killedBy: Gilded Rose:update quality when the item is named Backstage passes to a TAFKAL80ETC concert should set the quality to 0 when the concert has ended
statusReason: expected 13 to equal 0

[Killed] BooleanLiteral
mooc/tdd-ex4/src/gilded_rose.js:38:15
             break;
           }
 
-          if (!increasesInQuality(item)) break;
+          if (increasesInQuality(item)) break;
 
           if (item.sellIn <= 5) {
killedBy: Gilded Rose:update quality when the item is named Backstage passes to a TAFKAL80ETC concert should increment quality by three when quality is less than 50 and sell in is 5 or less
statusReason: expected 10 to equal 13

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:38:15
             break;
           }
 
-          if (!increasesInQuality(item)) break;
+          if (true) break;
 
           if (item.sellIn <= 5) {
killedBy: Gilded Rose:update quality when the item is named Backstage passes to a TAFKAL80ETC concert should increment quality by three when quality is less than 50 and sell in is 5 or less
statusReason: expected 10 to equal 13

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:40:15
 
           if (!increasesInQuality(item)) break;
 
-          if (item.sellIn <= 5) {
+          if (true) {
             item.quality += 3;
             break;
killedBy: Gilded Rose:update quality when the item is named Backstage passes to a TAFKAL80ETC concert should increment quality by two when quality is less than 50 and sell in is between 10 and 6
statusReason: expected 51 to equal 50

[Killed] BlockStatement
mooc/tdd-ex4/src/gilded_rose.js:40:33
 
           if (!increasesInQuality(item)) break;
 
-          if (item.sellIn <= 5) {
-            item.quality += 3;
-            break;
-          }
+          if (item.sellIn <= 5) {}
           if (item.sellIn <= 10) {
             item.quality += 2;
killedBy: Gilded Rose:update quality when the item is named Backstage passes to a TAFKAL80ETC concert should increment quality by three when quality is less than 50 and sell in is 5 or less
statusReason: expected 12 to equal 13

[Killed] EqualityOperator
mooc/tdd-ex4/src/gilded_rose.js:44:15
             item.quality += 3;
             break;
           }
-          if (item.sellIn <= 10) {
+          if (item.sellIn < 10) {
             item.quality += 2;
             break;
killedBy: Gilded Rose:update quality when the item is named Backstage passes to a TAFKAL80ETC concert should increment quality by two when quality is less than 50 and sell in is between 10 and 6
statusReason: expected 49 to equal 50

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:44:15
             item.quality += 3;
             break;
           }
-          if (item.sellIn <= 10) {
+          if (false) {
             item.quality += 2;
             break;
killedBy: Gilded Rose:update quality when the item is named Backstage passes to a TAFKAL80ETC concert should increment quality by two when quality is less than 50 and sell in is between 10 and 6
statusReason: expected 49 to equal 50

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:50:9
           }
           item.quality += 1;
           break;
-        default:
-          if (decreasesInQuality(item)) {
-            if (itemIsPastSaleDate) {
-              item.quality -= 2;
-            } else {
-              item.quality -= 1;
-            }
-          }
-          if (!isLegendaryItem(item)) {
-            item.sellIn--;
-          }
-          break;
+        default:
       }
 
killedBy: Gilded Rose:update quality should decrement the sell in of items by one for an item not named 'Sulfuras, Hand of Ragnaros'
statusReason: expected 1 to equal 0

[Killed] BlockStatement
mooc/tdd-ex4/src/gilded_rose.js:51:41
           item.quality += 1;
           break;
         default:
-          if (decreasesInQuality(item)) {
-            if (itemIsPastSaleDate) {
-              item.quality -= 2;
-            } else {
-              item.quality -= 1;
-            }
-          }
+          if (decreasesInQuality(item)) {}
           if (!isLegendaryItem(item)) {
             item.sellIn--;
killedBy: Gilded Rose:update quality when items are not named Aged brie or Backstage passes to a TAFKAL80ETC concert should degrade quality of item(s) by one
statusReason: expected 10 to equal 9

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:51:15
           item.quality += 1;
           break;
         default:
-          if (decreasesInQuality(item)) {
+          if (false) {
             if (itemIsPastSaleDate) {
               item.quality -= 2;
killedBy: Gilded Rose:update quality when items are not named Aged brie or Backstage passes to a TAFKAL80ETC concert should degrade quality of item(s) by one
statusReason: expected 10 to equal 9

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:52:17
           break;
         default:
           if (decreasesInQuality(item)) {
-            if (itemIsPastSaleDate) {
+            if (false) {
               item.quality -= 2;
             } else {
killedBy: Gilded Rose:update quality when items are not named Aged brie or Backstage passes to a TAFKAL80ETC concert when the item sell in is less than 0 should decrement quality by two when the quality is grea
statusReason: expected 9 to equal 8

[Killed] BlockStatement
mooc/tdd-ex4/src/gilded_rose.js:52:37
           break;
         default:
           if (decreasesInQuality(item)) {
-            if (itemIsPastSaleDate) {
-              item.quality -= 2;
-            } else {
+            if (itemIsPastSaleDate) {} else {
               item.quality -= 1;
             }
killedBy: Gilded Rose:update quality when items are not named Aged brie or Backstage passes to a TAFKAL80ETC concert when the item sell in is less than 0 should decrement quality by two when the quality is grea
statusReason: expected 10 to equal 8

[Killed] BlockStatement
mooc/tdd-ex4/src/gilded_rose.js:54:20
           if (decreasesInQuality(item)) {
             if (itemIsPastSaleDate) {
               item.quality -= 2;
-            } else {
-              item.quality -= 1;
-            }
+            } else {}
           }
           if (!isLegendaryItem(item)) {
killedBy: Gilded Rose:update quality when items are not named Aged brie or Backstage passes to a TAFKAL80ETC concert should degrade quality of item(s) by one
statusReason: expected 10 to equal 9

[Killed] ConditionalExpression
mooc/tdd-ex4/src/gilded_rose.js:58:15
               item.quality -= 1;
             }
           }
-          if (!isLegendaryItem(item)) {
+          if (true) {
             item.sellIn--;
           }
killedBy: Gilded Rose:update quality should not decrement the sell in of items named 'Sulfuras, Hand of Ragnaros'
statusReason: expected 0 to equal 1

[Killed] BlockStatement
mooc/tdd-ex4/src/gilded_rose.js:58:39
               item.quality -= 1;
             }
           }
-          if (!isLegendaryItem(item)) {
-            item.sellIn--;
-          }
+          if (!isLegendaryItem(item)) {}
           break;
       }
killedBy: Gilded Rose:update quality should decrement the sell in of items by one for an item not named 'Sulfuras, Hand of Ragnaros'
statusReason: expected 1 to equal 0

[Killed] UpdateOperator
mooc/tdd-ex4/src/gilded_rose.js:59:13
             }
           }
           if (!isLegendaryItem(item)) {
-            item.sellIn--;
+            item.sellIn++;
           }
           break;
killedBy: Gilded Rose:update quality should decrement the sell in of items by one for an item not named 'Sulfuras, Hand of Ragnaros'
statusReason: expected 2 to equal 0
